constant/fuelZone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fuelZone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(
    inlet
    {
        type            patch;
        nFaces          5188;
        startFace       87212;
    }

    outlet
    {
        type            patch;
        nFaces          5188;
        startFace       92400;
    }

    fuelZone_to_claddingZone
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          1968;
        startFace       97588;
        sampleMode      nearestPatchFace;
        sampleRegion    claddingZone;
        samplePatch     claddingZone_to_fuelZone;
    }

)


// ************************************************************************* //
