constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
inlet
{
    type patch;
    nFaces 16384;
    startFace 276992;
}

outlet
{
    type patch;
    nFaces 16384;
    startFace 293376;
}

min_x
{
    type symmetryPlane;
    nFaces 768;
    startFace 309760;
}

max_x
{
    type symmetryPlane;
    nFaces 768;
    startFace 310528;
}

min_y
{
    type symmetryPlane;
    nFaces 768;
    startFace 311296;
}

max_y
{
    type symmetryPlane;
    nFaces 768;
    startFace 312064;
}

)


// ************************************************************************* //
