constant/fuelZone/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;      // Constant isotropic thermal conductivity
    thermo          hConst;         // Constant specific heat capacity (Cp)
    equationOfState rhoConst;       // Constant density solid model
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       270.03;     // Molecular weight of UO2 (g/mol)
    }
    transport
    {
        kappa           3.0;        // Thermal conductivity of UO2 pellet (W/m*K)
    }
    thermodynamics
    {
        Hf              0;
        Cp              300;        // Specific heat capacity of UO2 (J/kg*K)
    }
    equationOfState
    {
        rho             10970;      // Theoretical density of solid UO2 (kg/m^3)
    }
}

// ************************************************************************* //
