0.orig/coolantZone/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0]; // Units: kg/(m*s) -> Dynamic eddy diffusivity

internalField   uniform 0;          // Standard initial placeholder

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    min_x
    {
        type            symmetryPlane;
    }
    max_x
    {
        type            symmetryPlane;
    }
    min_y
    {
        type            symmetryPlane;
    }
    max_y
    {
        type            symmetryPlane;
    }
    coolantZone_to_claddingZone
    {
        type            alphatWallFunction;
        Prt             0.85;             // Turbulent Prandtl number (standard for water)
        value           uniform 0;
    }
}

// ************************************************************************* //

