system/claddingZone/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2412
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    inlet                       { type patch; }
    outlet                       { type patch; }
    claddingZone_to_coolantZone { type mappedWall; }
    claddingZone_to_fuelZone    { type mappedWall; }
}

T
{
    internalField   uniform 600; // Estimated initial solid cladding temperature
    boundaryField
    {
        inlet                       { type zeroGradient; }
        outlet                      { type zeroGradient; }
        claddingZone_to_coolantZone
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tmesh           T;
            kappaMethod     solidThermo; // Pulls conductivity from solid properties
            value           uniform 600;
        }
        claddingZone_to_fuelZone
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tmesh           T;
            kappaMethod     solidThermo;
            value           uniform 600;
        }
    }
}

p
{
    internalField   uniform 15700000;
    boundaryField
    {
        inlet                       { type calculated; value uniform 15700000; }
        outlet                      { type calculated; value uniform 15700000; }
        claddingZone_to_coolantZone { type calculated; value uniform 15700000; }
        claddingZone_to_fuelZone    { type calculated; value uniform 15700000; }

    }
}
h
{
    internalField   uniform 198000;
    boundaryField
    {
        claddingZone_to_coolantZone { type calculated;  value uniform 198000;}
        claddingZone_to_fuelZone    { type calculated;  value uniform 198000;}
        
        // FIX: Provide explicit physical constraints for the external boundaries
        inlet                       { type zeroGradient; }
        outlet                      { type zeroGradient; }

    }
}
// ************************************************************************* //